app/controllers/conjugations_controller.rb

SELECT "conjugations".* FROM "conjugations" ORDER BY verb
---
  def index
    @conjugations = Conjugation.all

SELECT "conjugations".* FROM "conjugations" WHERE "conjugations"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @conjugation = Conjugation.find(params[:id])

SELECT "conjugations".* FROM "conjugations" WHERE "conjugations"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @conjugation = Conjugation.find(params[:id])

INSERT INTO "conjugations" ("created_at", "first_plural", "first_singular", "second_plural", "second_singular", "tense", "third_plural", "third_singular", "updated_at", "verb") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @conjugation = Conjugation.new(params[:conjugation])

    respond_to do |format|
      if @conjugation.save

SELECT "conjugations".* FROM "conjugations" WHERE "conjugations"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "conjugations" SET "first_singular" = 'm''anges', "updated_at" = '2012-03-27 17:12:14.400781' WHERE "conjugations"."id" = 1
---
  def update
    @conjugation = Conjugation.find(params[:id])

    respond_to do |format|
      if @conjugation.update_attributes(params[:conjugation])

SELECT "conjugations".* FROM "conjugations" WHERE "conjugations"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "conjugations" WHERE "conjugations"."id" = ?  [["id", 1]]
---
  def destroy
    @conjugation = Conjugation.find(params[:id])
    @conjugation.destroy